import React, { FC } from "react";

export const Good: FC = () => (
  <svg
    className="h-6 w-6 fill-indigo-500"
    id="_レイヤー_10"
    viewBox="0 0 192 192"
    xmlns="http://www.w3.org/2000/svg"
  >
    <rect
      className="cls-1"
      height="93.03"
      rx="2.06"
      ry="2.06"
      width="36"
      x="32"
      y="64.97"
    />
    <path
      className="cls-1"
      d="m68,70h2.99c.64,0,1.24-.29,1.63-.8l26.76-34.41c.39-.5.99-.8,1.63-.8h20.13c1.41,0,2.4,1.38,1.96,2.71l-10.19,30.57c-.45,1.34.55,2.71,1.96,2.71h39.58c.92,0,1.73.61,1.98,1.5l7.42,25.97c.1.35.11.72.02,1.07l-15.67,57.9c-.23.92-1.05,1.56-2,1.56h-69.9c-.32,0-.64-.07-.92-.22l-7.37-5.78"
    />
  </svg>
);
